<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.43 in css mode. -->
<html>
  <head>
    <title>2013-books.org</title>
    <style type="text/css">
    <!--
      body {
        color: #DCDCCC;
        background-color: #3F3F3F;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-weight: bold;
      }
      .org-level-1 {
        /* org-level-1 */
        color: #DFAF8F;
        font-size: 130%;
        text-decoration: overline;
      }
      .org-link {
        /* org-link */
        color: #D0BF8F;
        text-decoration: underline;
      }
      .org-meta-line {
        /* org-meta-line */
        color: #7F9F7F;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
<span class="org-meta-line">#+OPTIONS: ^:nil</span>
<span class="org-meta-line">#+OPTIONS: toc:t H:2</span>
<span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">Zhengchao Xu
</span><span class="org-document-info-keyword">#+EMAIL:</span> <span class="org-document-info">xuzhengchaojob@gmail.com
</span><span class="org-document-info-keyword">#+TITLE:</span> <span class="org-document-title">2013&#24180;&#35835;&#36807;&#30340;&#23454;&#20307;&#20070;
</span>
&#27605;&#19994;&#20043;&#21518;&#65292;&#24320;&#22987;&#19978;&#29677;&#26063;&#30340;&#29983;&#27963;&#65292;&#20844;&#21496;-&#23478;&#20004;&#28857;&#19968;&#32447;&#65292;&#19979;&#29677;&#22238;&#21435;&#20102;&#65292;
&#27809;&#20102;&#23517;&#23460;&#38598;&#20307;&#32842;&#22825;&#65292;&#20063;&#27809;&#20102;&#36319;&#23567;&#21018;&#21018;&#21435;&#25805;&#22330;&#19968;&#22280;&#22280;&#36305;&#27493;&#65292;
&#20063;&#27809;&#20102;BRYBT&#26080;&#25968;&#30340;&#39640;&#28165;&#30005;&#24433;&#21487;&#20197;&#30475;&#12290;&#35835;&#20070;&#30340;&#26102;&#38388;&#22810;&#20102;&#36215;&#26469;&#12290;

&#25105;&#19968;&#33324;&#20080;&#25216;&#26415;&#20070;&#27604;&#36739;&#22810;&#19968;&#20123;&#65292;&#23588;&#20854;&#26159;&#20687;ULK&#12289;CSPP&#36825;&#20123;&#32463;&#20856;&#21040;&#29190;&#30340;&#8221;&#31070;&#20070;&#8220;&#12290;
&#32780;&#35910;&#33457;&#21516;&#23398;&#20250;&#20080;&#21508;&#31181;&#21508;&#26679;&#30340;&#20070;&#65292;&#28459;&#30011;&#12289;&#25991;&#23398;&#31561;&#31561;&#31561;&#31561;&#12290;&#36825;&#20010;&#25645;&#37197;&#35753;&#25105;&#24456;&#21916;&#27426;&#12290;

&#20165;&#20197;&#27492;&#25991;&#65292;&#35760;&#24405;&#25105;2013&#24180;&#35835;&#36807;&#30340;&#8221;&#23454;&#20307;&#8220;&#20070;&#31821;&#12290;

<span class="org-level-1">* 1.[&#12298;&#19968;&#20010;&#20154;&#20303;&#30340;&#27599;&#19968;&#22825;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/6387054/">http://book.douban.com/subject/6387054/</a></span><span class="org-level-1">)&#65288;&#39640;&#26408;&#30452;&#23376;&#65289;</span>

&#36825;&#26159;&#19968;&#26412;&#28459;&#30011;&#20070;&#65292;&#20316;&#32773;&#29992;&#28459;&#30011;&#35762;&#36848;&#20102;&#33258;&#24049;&#22312;&#19996;&#20140;&#29983;&#27963;&#30340;&#28857;&#28857;&#28404;&#28404;&#12290;&#21253;&#25324;&#21507;&#39277;&#12289;&#31199;&#25151;&#12289;&#20107;&#19994;&#31561;&#31561;&#12290;

&#19968;&#20010;&#20154;&#21040;&#19996;&#20140;&#38383;&#33633;&#19981;&#23481;&#26131;&#65292;&#23588;&#20854;&#26159;&#21435;&#24403;&#28459;&#30011;&#23478;&#36825;&#31181;&#25104;&#21151;&#29575;&#24456;&#20302;&#30340;&#32844;&#19994;&#12290;
&#20316;&#32773;&#22312;&#29992;&#28201;&#39336;&#30340;&#22522;&#35843;&#22238;&#24518;&#33258;&#24049;&#22312;&#19996;&#20140;&#21162;&#21147;&#22859;&#26007;&#30340;&#26085;&#23376;&#12290;

&#20197;&#21069;&#37117;&#26159;&#22312;&#32593;&#19978;&#30475;&#12298;&#28779;&#24433;&#24525;&#32773;&#12299;&#12289;&#12298;&#28023;&#36156;&#29579;&#12299;&#36825;&#20123;&#39118;&#38753;&#20840;&#29699;&#30340;&#28459;&#30011;&#65292;&#36825;&#26159;&#31532;&#19968;&#27425;&#30475;&#25551;&#20889;&#30495;&#23454;&#29983;&#27963;&#30340;&#28459;&#30011;&#12290;
&#35273;&#24471;&#24456;&#26377;&#36259;&#65292;&#26085;&#26412;&#30495;&#26159;&#20010;&#28459;&#30011;&#21457;&#23637;&#36229;&#32423;&#25104;&#29087;&#30340;&#22269;&#23478;&#12290;


<span class="org-level-1">* 2.[&#12298;&#28145;&#22812;&#39135;&#22530;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/20470917/">http://book.douban.com/subject/20470917/</a></span><span class="org-level-1">)&#65288;&#23433;&#20493;&#22812;&#37070;&#65289;</span>

&#36825;&#20010;&#31995;&#21015;&#19968;&#20849;&#26377;&#20843;&#26412;&#65292;&#30446;&#21069;&#30475;&#23436;&#20102;&#19977;&#26412;&#12290;&#27599;&#19968;&#26412;&#37117;&#26377;&#21313;&#20960;&#20010;&#23567;&#25925;&#20107;&#32452;&#25104;&#12290;

&#28459;&#30011;&#30340;&#20027;&#20154;&#20844;&#26159;&#19968;&#20010;&#23567;&#39277;&#39302;&#30340;&#32769;&#26495;&#65292;&#20182;&#30340;&#32463;&#33829;&#26102;&#38388;&#26159;&#26202;&#19978;10&#28857;&#21040;&#26089;&#19978;6&#28857;&#12290;
&#24215;&#37324;&#30340;&#33756;&#35889;&#21482;&#20889;&#20102;&#20960;&#26679;&#33756;&#65292;&#20294;&#26159;&#21482;&#35201;&#20320;&#28857;&#65292;&#32769;&#26495;&#22522;&#26412;&#20160;&#20040;&#37117;&#20250;&#20570;&#12290;
&#20250;&#26377;&#21508;&#31181;&#21508;&#26679;&#30340;&#20154;&#21040;&#36825;&#37324;&#26469;&#21507;&#39277;&#65292;&#19978;&#29677;&#26063;&#12289;&#30456;&#22768;&#28436;&#21592;&#12289;&#28459;&#30011;&#23478;&#12289;
AV&#22899;&#20248;...&#20182;&#20204;&#26377;&#30340;&#36319;&#32769;&#26495;&#24456;&#29087;&#65292;&#26377;&#30340;&#21017;&#26159;&#31532;&#19968;&#27425;&#26469;&#12290;
&#27599;&#20010;&#20154;&#37117;&#26377;&#33258;&#24049;&#21916;&#27426;&#21507;&#30340;&#19968;&#31181;&#39135;&#29289;&#65292;&#27599;&#20010;&#20154;&#37117;&#26377;&#33258;&#24049;&#30340;&#19968;&#20010;&#25925;&#20107;&#12290;&#25110;&#26159;&#29233;&#24773;&#12289;&#25110;&#26159;&#20146;&#24773;&#12289;&#25110;&#26159;&#20107;&#19994;&#12290;

&#28145;&#22812;&#30340;&#26102;&#20505;&#65292;&#20182;&#20204;&#20250;&#26469;&#21040;&#32769;&#26495;&#30340;&#24215;&#37324;&#65292;&#28857;&#19968;&#20010;&#20182;&#20204;&#21916;&#27426;&#21507;&#30340;&#39277;&#65292;
&#28982;&#21518;&#36319;&#32769;&#26495;&#25110;&#20854;&#20182;&#30340;&#23458;&#20154;&#35762;&#20182;&#20204;&#30340;&#20107;&#19994;&#25110;&#29983;&#27963;&#65292;
&#36825;&#20123;&#25925;&#20107;&#37117;&#20250;&#26377;&#19968;&#20010;&#32467;&#23614;&#65292;&#21487;&#33021;&#26159;&#22909;&#30340;&#65292;&#20063;&#21487;&#33021;&#26159;&#22351;&#30340;&#12290;

&#32769;&#26495;&#23601;&#36825;&#26679;&#65292;&#27599;&#22825;&#36814;&#25509;&#19981;&#21516;&#30340;&#23458;&#20154;&#65292;&#30475;&#29983;&#27963;&#19975;&#24577;&#65292;&#20182;&#24456;&#23569;&#23545;&#21035;&#20154;&#30340;&#20107;&#24773;&#21457;&#34920;&#35780;&#35770;&#65292;&#21482;&#25226;&#20182;&#20204;&#21916;&#27426;&#21507;&#30340;&#19996;&#35199;&#20570;&#22909;&#12290;

&#22312;&#28145;&#22812;&#30340;&#19996;&#20140;&#34903;&#22836;&#65292;&#33021;&#21507;&#21040;&#33258;&#24049;&#21916;&#27426;&#30340;&#39135;&#29289;&#65292;&#23601;&#26159;&#24184;&#31119;&#12290;

<span class="org-level-1">* 3.[&#12298;1980&#24180;&#20195;&#30340;&#29233;&#24773;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/25696089/">http://book.douban.com/subject/25696089/</a></span><span class="org-level-1">)&#65288;&#22303;&#23478;&#37326;&#22827;&#65289;</span>

&#25925;&#20107;&#30340;&#22823;&#32972;&#26223;&#26159;&#37027;&#20010;&#33618;&#35806;&#30340;&#26102;&#20195;&#21069;&#21518;&#65292;&#20027;&#20154;&#20844;&#22823;&#23398;&#27605;&#19994;&#65292;
&#34987;&#20998;&#37197;&#21040;&#20559;&#36828;&#23425;&#38745;&#30340;&#37122;&#35199;&#23567;&#38215;&#19978;&#65292;&#22312;&#19968;&#27425;&#25171;&#37202;&#30340;&#26102;&#20505;&#65292;
&#36935;&#21040;&#20102;&#33258;&#24049;&#21916;&#27426;&#30340;&#22899;&#21516;&#23398;&#12290;

&#8221;&#25105;&#30693;&#36947;&#65292;&#24403;&#25105;&#20204;&#35848;&#35770;&#29233;&#24773;&#26102;&#65292;&#25105;&#20204;&#26368;&#32456;&#26159;&#22312;&#31085;&#22880;&#37027;&#20123;&#26080;&#37034;&#26080;&#36764;&#26080;&#27442;&#26080;&#24724;&#30340;&#38738;&#26149;&#8220;&#12290;

&#36825;&#26412;&#20070;&#35762;&#20102;&#19968;&#20010;&#24456;&#32654;&#24456;&#32654;&#30340;&#29233;&#24773;&#25925;&#20107;&#65292;&#21644;&#19968;&#20010;&#20877;&#20063;&#22238;&#19981;&#21435;&#30340;&#26102;&#20195;&#12290;

<span class="org-level-1">* 4.[&#12298;&#36523;&#36793;&#30340;&#27743;&#28246;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/25639223/">http://book.douban.com/subject/25639223/</a></span><span class="org-level-1">)&#65288;&#22303;&#23478;&#37326;&#22827;&#65289;</span>

&#22312;&#21435;&#26477;&#24030;&#30340;&#28779;&#36710;&#19978;&#35835;&#23436;&#20102;&#36825;&#26412;&#20070;&#65292;&#35835;&#23436;&#20043;&#21518;&#24819;&#21917;&#37202;&#30340;&#20914;&#21160;&#29305;&#21035;&#24378;&#28872;&#12290;

&#28982;&#21518;&#37027;&#22825;&#26524;&#30495;&#21917;&#20102;&#19981;&#23569;&#37202;&#12290;&#22312;&#35199;&#28246;&#19978;&#65292;&#26376;&#22278;&#39118;&#36731;&#65292;&#21010;&#33337;&#30340;&#23567;&#21733;&#36319;&#25105;&#20204;&#25199;&#24456;&#22810;&#26477;&#24030;&#30340;&#25925;&#20107;&#65292;
&#23567;&#33337;&#26179;&#26469;&#26179;&#21435;&#65292;&#25105;&#19968;&#20010;&#20154;&#33258;&#39278;&#26202;&#39277;&#21097;&#19979;&#30340;&#21322;&#29942;&#8220;&#32461;&#20852;&#21152;&#39277;&#37202;&#8221;&#65292;
&#24819;&#30528;&#35768;&#20185;&#21644;&#30333;&#23064;&#23376;&#30340;&#25925;&#20107;&#12290;

&#36825;&#26159;&#26412;&#32426;&#23454;&#20070;&#65292;&#37326;&#22827;&#20889;&#20102;&#20182;&#24456;&#22810;&#30340;&#26379;&#21451;&#65292;&#36825;&#20123;&#26379;&#21451;&#21644;&#20182;&#19968;&#26679;&#65292;&#26377;&#30528;&#20256;&#22855;&#30340;&#32463;&#21382;&#21644;&#27922;&#33073;&#30340;&#20154;&#26684;&#12290;
&#26377;&#26102;&#20505;&#25105;&#20250;&#32673;&#24917;&#37027;&#20123;&#22235;&#20116;&#21313;&#23681;&#30340;&#29238;&#36744;&#65292;&#22312;&#20182;&#20204;&#24180;&#36731;&#30340;&#26102;&#20505;&#65292;&#27491;&#32463;&#21382;&#30528;&#36825;&#20010;&#22269;&#23478;&#26368;&#22909;&#30340;&#22823;&#23398;&#29615;&#22659;&#65292;
&#22312;&#27809;&#26377;&#30005;&#33041;&#27809;&#26377;&#28216;&#25103;&#24182;&#19988;&#19981;&#29992;&#20026;&#27605;&#19994;&#21457;&#24833;&#30340;&#24180;&#20195;&#65292;&#20182;&#20204;&#26377;&#35799;&#12289;&#26377;&#21746;&#23398;&#12289;&#26377;&#27665;&#35875;&#21644;&#29233;&#24773;&#12290;

&#23601;&#20687;&#39640;&#26195;&#26494;&#22312;&#12298;[&#22823;&#24072;&#29031;&#20142;&#20843;&#21313;&#24180;&#20195;](<span class="org-link"><a href="http://v.youku.com/v_show/id_XNDQwMDU0NDg4.html">http://v.youku.com/v_show/id_XNDQwMDU0NDg4.html</a></span>)&#12299;
&#35828;&#30340;&#37027;&#26679;:"&#29616;&#22312;&#30340;&#20154;&#21487;&#33021;&#26080;&#27861;&#29702;&#35299;&#24403;&#26102;&#25105;&#20204;&#30340;&#37027;&#31181;&#24515;&#24773;&#8212;&#8212;&#22312;&#25105;&#20204;&#36824;&#31359;&#30528;&#30340;&#30830;&#33391;&#35044;&#23376;&#65292;&#31359;&#30528;&#26825;&#38795;&#65292;
&#23478;&#37324;&#21482;&#26377;&#40657;&#30333;&#30005;&#35270;&#30340;&#26102;&#20505;&#65292;&#31361;&#28982;&#30475;&#21040;&#20102;&#36808;&#20811;&#23572;&#183;&#26480;&#20811;&#36874;&#65292;&#24403;&#26102;&#25105;&#20204;&#30495;&#30340;&#30127;&#25481;&#20102;&#65281;
&#25105;&#20204;&#23601;&#36825;&#26679;&#36824;&#30475;&#21040;&#20102;&#40614;&#24403;&#23068;&#65292;&#30475;&#21040;&#20102;U2&#65292;&#30475;&#21040;&#20102;Guns N' Roses&#65288;&#26538;&#28846;&#19982;&#29611;&#29808;&#65289;&#20048;&#38431;&#12290;"&#12290;

&#19978;&#21322;&#24180;&#21435;&#30005;&#24433;&#38498;&#30475;&#12298;&#20013;&#22269;&#21512;&#20249;&#20154;&#12299;&#65292;&#24403;&#36861;&#27714;&#33258;&#30001;&#28010;&#28459;&#30340;&#29579;&#38451;&#21741;&#30528;&#21098;&#25481;&#19968;&#22836;&#38271;&#21457;&#30340;&#26102;&#20505;&#65292;
&#24515;&#37324;&#19968;&#38453;&#21050;&#30171;&#12290;

<span class="org-level-1">* 5.[&#12298;git &#26435;&#23041;&#25351;&#21335;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/6526452/">http://book.douban.com/subject/6526452/</a></span><span class="org-level-1">)&#65288;&#33931;&#37995;&#65289;</span>

&#19968;&#30452;&#35273;&#24471;&#26159;linus&#22823;&#31070;&#38663;&#21160;&#19990;&#30028;&#30340;&#31532;&#20108;&#22823;&#8220;&#31070;&#22120;&#8221;&#65288;&#20320;&#30693;&#36947;&#31532;&#19968;&#22823;&#26159;&#20160;&#20040;&#21527;&#65311;&#65289;

&#22914;&#26524;&#26377;&#20154;&#24819;&#28145;&#20837;&#20102;&#35299;git&#65292;&#25105;&#20250;&#24456;&#25512;&#33616;&#36825;&#26412;&#20070;&#12290;&#20316;&#32773;&#26159;&#29256;&#26412;&#25511;&#21046;&#39046;&#22495;&#30340;&#19987;&#23478;&#65292;
&#20182;&#23545;git&#30340;&#20102;&#35299;&#21644;&#30475;&#24453;git&#30340;&#35270;&#35282;&#20250;&#35753;&#20320;&#21463;&#30410;&#21290;&#27973;&#12290;

<span class="org-level-1">* 6.[&#12298;Linux&#20869;&#26680;&#35774;&#35745;&#19982;&#23454;&#29616;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/6097773/">http://book.douban.com/subject/6097773/</a></span><span class="org-level-1">)&#65288;Robert Love&#65289;</span>

&#36825;&#26412;&#20070;&#65292;&#25105;&#27599;&#24180;&#37117;&#20250;&#35835;&#19968;&#36941;&#65292;&#27599;&#27425;&#37117;&#26377;&#26032;&#30340;&#25910;&#33719;&#12290;

<span class="org-level-1">* 7.[&#12298;&#24403;&#25105;&#35848;&#36305;&#27493;&#26102;&#25105;&#35848;&#20160;&#20040;&#12299;](</span><span class="org-link"><a href="http://book.douban.com/subject/4872222/">http://book.douban.com/subject/4872222/</a></span><span class="org-level-1">)&#65288;&#26449;&#19978;&#26149;&#26641;&#65289;</span>

&#36305;&#27493;+&#25991;&#33402;&#30340;&#20070;.
</pre>
  </body>
</html>
