<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.43 in css mode. -->
<html>
  <head>
    <title>second-marathon.org</title>
    <style type="text/css">
    <!--
      body {
        color: #DCDCCC;
        background-color: #3F3F3F;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-weight: bold;
      }
      .org-meta-line {
        /* org-meta-line */
        color: #7F9F7F;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
<span class="org-meta-line">#+OPTIONS: ^:nil</span>
<span class="org-meta-line">#+OPTIONS: toc:t H:2</span>
<span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">Zhengchao Xu
</span><span class="org-document-info-keyword">#+EMAIL:</span> <span class="org-document-info">xuzhengchaojob@gmail.com
</span><span class="org-document-info-keyword">#+TITLE:</span> <span class="org-document-title">&#31532;&#20108;&#27425;&#21271;&#20140;&#39532;&#25289;&#26494;
</span>
&#19978;&#21320;&#22521;&#35757;&#65292;&#25277;&#31354;&#30475;&#20102;&#19979;&#25163;&#26426;&#65292;10&#26376;30&#21495;&#65292;&#31361;&#28982;&#35273;&#24471;&#36825;&#20010;&#26085;&#23376;&#26377;&#28857;&#29305;&#21035;&#65292;&#24819;&#20102;&#19968;&#20250;&#65292;&#24819;&#36215;&#26159;
&#29642;&#22992;&#30340;&#29983;&#26085;&#65292;&#20110;&#26159;&#30331;&#19978;QQ&#31069;&#22905;&#29983;&#26085;&#24555;&#20048;&#65292;&#28982;&#21518;&#32842;&#20102;&#19968;&#20250;&#12290;&#27605;&#19994;&#24046;&#19981;&#22810;&#19968;&#24180;&#21322;&#65292;&#19968;&#30452;&#27809;&#35265;&#65292;
&#32463;&#24120;&#35828;&#26377;&#31354;&#19968;&#36215;&#21507;&#39277;&#65292;&#20294;&#26159;&#21608;&#26411;&#32463;&#24120;&#26377;&#20107;&#25110;&#25042;&#24471;&#21160;&#12290;&#36825;&#39277;&#20063;&#19968;&#30452;&#27809;&#21507;&#19978;&#65292;&#29031;&#36825;&#26679;&#65292;&#20272;&#35745;&#35201;&#31561;&#21040;&#26126;&#24180;&#21435;
&#21442;&#21152;&#22905;&#30340;&#23130;&#31036;&#30340;&#26102;&#20505;&#25165;&#33021;&#20877;&#35265;&#20102;&#12290;^_^

10&#26376;&#23601;&#35201;&#36807;&#21435;&#20102;&#65292;&#32454;&#24819;&#20102;&#19968;&#19979;&#65292;&#36825;&#20010;&#26376;&#21457;&#29983;&#20102;&#20004;&#20010;&#37325;&#35201;&#30340;&#20107;&#65306;1,&#22269;&#24198;&#38271;&#20551;&#65292;&#22238;&#32769;&#23478;&#25226;&#20146;&#35746;&#20102;&#65292;&#20063;&#24046;&#19981;&#22810;
&#32467;&#26463;&#20102;&#25105;&#22920;&#38271;&#36798;&#19968;&#24180;&#30340;&#21792;&#21480;&#12290;2, 10&#26376;20&#21495;&#65292;&#36305;&#20102;&#20154;&#29983;&#31532;&#20108;&#20010;&#39532;&#25289;&#26494;&#12290;

&#21435;&#24180;&#36305;&#23436;&#20154;&#29983;&#31532;&#19968;&#27425;&#39532;&#25289;&#26494;&#20043;&#21518;&#65292;&#25105;&#23601;&#30693;&#36947;&#65292;&#39532;&#25289;&#26494;&#36825;&#20214;&#20107;&#65292;&#23558;&#26159;&#25105;&#19968;&#36744;&#23376;&#30340;&#20107;&#24773;&#12290;&#21482;&#35201;&#36824;&#33021;&#36305;&#24471;&#21160;&#65292;
&#23601;&#20250;&#19968;&#30452;&#36305;&#19968;&#19979;&#21435;&#65292;50&#23681;&#65292;60&#23681;&#65292;&#29978;&#33267;70&#23681;&#12290;

&#36825;&#24182;&#19981;&#26159;&#35828;&#25105;&#21435;&#24180;&#39532;&#25289;&#26494;&#36305;&#24471;&#24456;&#29245;&#65292;&#23506;&#20908;&#33098;&#26376;&#65292;&#31967;&#31957;&#30340;&#22825;&#27668;&#65292;&#27627;&#26080;&#20934;&#22791;&#36817;&#20284;&#8220;&#35064;&#36305;&#8221;&#30340;&#21442;&#19982;&#12290;
&#21152;&#19978;&#38795;&#23376;&#20063;&#19981;&#26159;&#24456;&#22909;&#65292;&#23436;&#20840;&#23601;&#26159;&#33258;&#25214;&#33510;&#21507;&#12290;&#23588;&#20854;&#36807;&#20102;24KM&#20043;&#21518;&#65292;&#26377;&#20960;&#20010;&#26379;&#21451;&#22312;&#36865;&#34917;&#32473;&#65292;&#21507;&#20102;&#21917;&#20102;&#20043;&#21518;&#65292;
&#21457;&#29616;&#20877;&#20063;&#36305;&#19981;&#21160;&#20102;&#65292;&#33136;/&#33050;&#37117;&#24320;&#22987;&#30140;&#30171;&#38590;&#24525;&#65292;&#21518;&#21313;&#20116;&#20844;&#37324;&#31616;&#30452;&#26159;&#19968;&#31181;&#8220;&#29983;&#19981;&#22914;&#27515;&#8221;&#30340;&#24863;&#35273;&#12290;

&#20294;&#26159;&#26368;&#32456;&#22362;&#25345;&#20102;&#19979;&#26469;&#65292;&#36825;&#23601;&#26159;&#39532;&#25289;&#26494;&#30340;&#39749;&#21147;&#65292;&#20107;&#23454;&#19978;&#22823;&#37096;&#20998;&#21442;&#36187;&#32773;&#22312;30KM&#20043;&#21518;&#37117;&#20250;&#20307;&#21147;&#21040;&#36798;&#26497;&#38480;&#65292;
&#20294;&#26159;&#8220;&#36208;&#20063;&#35201;&#36208;&#19979;&#26469;&#8221;&#26159;&#22823;&#37096;&#20998;&#20154;&#30340;&#36873;&#25321;&#65292;&#20307;&#21147;&#30340;&#29006;&#29100;&#21644;&#30140;&#30171;&#21482;&#26377;&#20146;&#36523;&#21442;&#19982;&#36807;&#25165;&#33021;&#20307;&#39564;&#21040;&#12290;&#8220;&#36208;&#20063;&#35201;&#36208;&#19979;&#26469;&#8221;
&#35828;&#36215;&#26469;&#23481;&#26131;&#65292;&#20570;&#36215;&#26469;&#23436;&#20840;&#26159;&#21478;&#22806;&#19968;&#22238;&#20107;&#12290;

&#36824;&#22909;&#20170;&#24180;&#30340;&#30828;&#20214;&#26465;&#20214;&#35201;&#22909;&#36807;&#21435;&#24180;&#65292;&#27809;&#20102;&#21313;&#20843;&#22823;&#65292;&#27604;&#36187;&#24674;&#22797;&#21040;&#20102;&#27491;&#24120;&#30340;10&#26376;&#20221;&#65292;&#22825;&#19981;&#20919;&#19981;&#28909;&#65292;&#27604;&#36187;&#21069;&#19968;&#22825;&#36824;
&#21038;&#20102;&#19968;&#22825;&#39118;&#65292;&#25226;&#29399;&#26085;&#30340;&#38654;&#38718;&#21561;&#24471;&#37027;&#21483;&#19968;&#20010;&#24178;&#20928;&#12290;&#22269;&#24198;&#22238;&#20140;&#21518;&#65292;&#29305;&#24847;&#21435;&#22885;&#29305;&#36182;&#26031;&#20080;&#20102;&#19968;&#21452;NB&#30340;&#36305;&#38795;&#65292;&#26412;&#26469;
&#24819;&#20080;asics&#30340;&#65292;&#20294;&#26159;&#30475;&#19978;&#30340;&#37027;&#27454;1000,&#27809;&#33293;&#24471;&#20080;&#65292;&#30475;&#21040;NB&#22312;&#25171;&#25240;&#65292;&#23601;&#20080;&#20102;&#19968;&#21452;&#20013;&#26723;&#30340;&#36305;&#38795;&#12290;&#22238;&#26469;&#36824;&#19987;&#38376;&#21435;&#20013;&#22830;&#32654;&#38498;
&#35797;&#20102;&#19968;&#19979;&#65292;&#24863;&#35273;&#36824;&#21487;&#20197;&#12290;

&#27491;&#25152;&#35859;&#8220;&#19975;&#20107;&#20855;&#22791;&#65292;&#21482;&#27424;&#26481;&#39118;&#8221;&#65292;20&#21495;&#19981;&#21040;5&#28857;&#23601;&#36215;&#20102;&#65292;&#20570;&#26089;&#39277;&#65292;&#21507;&#23436;&#36319;&#22899;&#26379;&#21451;&#22352;&#20844;&#20132;&#20498;&#22320;&#38081;&#21435;&#22825;&#23433;&#38376;&#65292;
&#22320;&#38081;&#37324;&#20840;&#26159;&#31359;&#27604;&#36187;&#34915;&#26381;&#30340;&#8220;&#36305;&#21451;&#8221;&#65292;&#25152;&#20197;&#25105;&#19968;&#30452;&#31216;&#20854;&#20026;&#8220;&#21271;&#20140;&#22478;&#19968;&#24180;&#19968;&#24230;&#26368;&#22823;&#30340;party&#8221;&#12290;

&#22312;&#21069;&#38376;&#36319;&#38431;&#20237;&#27719;&#21512;&#65292;&#20116;&#20010;&#20840;&#39532;+&#19968;&#20010;&#21322;&#39532;&#65292;&#28982;&#21518;&#20986;&#22320;&#38081;&#65292;&#36328;&#36234;&#19977;&#20010;&#22320;&#19979;&#36890;&#36947;&#21435;&#27604;&#36187;&#20986;&#21457;&#28857;&#12290;&#34429;&#28982;&#22312;&#20154;&#25968;&#19978;&#21487;&#20197;&#36319;&#19990;&#30028;
&#39030;&#32423;&#39532;&#25289;&#26494;&#36187;&#20107;&#23218;&#32654;&#65292;&#20294;&#21271;&#20140;&#39532;&#25289;&#26494;&#30340;&#32452;&#32455;&#19968;&#30452;&#26159;&#34987;&#22823;&#23478;&#39554;&#23064;&#30340;&#12290;&#20174;&#39046;&#35013;&#22791;&#24320;&#22987;&#23601;&#21487;&#20197;&#30475;&#20986;&#21271;&#39532;&#32452;&#32455;&#30340;&#25928;&#29575;&#20043;&#20302;&#65292;
&#27599;&#24180;&#39046;&#34915;&#26381;&#37117;&#26159;&#20960;&#20010;&#22823;&#22920;&#22312;&#21457;&#34915;&#26381;&#65292;&#21322;&#22825;&#25214;&#19981;&#21040;&#19968;&#20214;&#65292;&#32463;&#24120;&#35201;&#25490;&#20960;&#20010;&#23567;&#26102;&#30340;&#38431;&#12290;&#27604;&#36187;&#24403;&#22825;&#20063;&#19968;&#26679;&#65292;&#20174;&#22320;&#38081;&#21475;&#21040;&#20986;&#21457;&#28857;
&#24635;&#26159;&#24471;&#25380;&#20010;&#19977;&#22235;&#21313;&#20998;&#38047;&#12290;&#19981;&#36807;&#35841;&#35753;&#20986;&#21457;&#28857;&#26159;&#22825;&#23433;&#38376;&#65292;&#23433;&#26816;&#24037;&#20316;&#32943;&#23450;&#26159;&#35201;&#20570;&#36275;&#30340;&#65292;&#20063;&#26159;&#27809;&#21150;&#27861;&#12290;

&#20843;&#28857;&#65292;&#20934;&#26102;&#20986;&#21457;&#65292;&#30001;&#20110;&#19982;&#38431;&#20237;&#22833;&#25955;&#65292;&#21482;&#33021;&#33258;&#24049;&#36305;&#12290;&#36305;&#20986;&#22825;&#23433;&#38376;&#24191;&#22330;&#65292;&#36827;&#20837;&#38271;&#23433;&#34903;&#65292;&#23601;&#30475;&#21040;N&#22810;&#20154;&#22312;&#36215;&#21700;&#65292;&#24448;&#21069;&#19968;&#30475;&#65292;
&#30343;&#22478;&#26681;&#19979;&#31449;&#28385;&#20102;&#19968;&#25490;&#20154;&#65292;&#22312;&#25746;&#23615;&#12290;&#21704;&#21704;&#65292;&#39039;&#35273;&#24456;&#26377;&#36259;&#65292;&#21518;&#26469;&#30475;&#21040;&#19968;&#31687;&#25991;&#31456;&#65292;&#8220;&#27599;&#24180;&#36305;&#19968;&#27425;&#39532;&#25289;&#26494;&#65292;&#19981;&#23601;&#20026;&#20102;&#22312;&#30343;&#22478;&#26681;
&#19979;&#25746;&#27873;&#23615;&#21527;&#65311;&#8221;&#65292;&#21313;&#20998;&#36148;&#20999;&#24418;&#35937;&#12290;&#22914;&#26524;&#21382;&#20195;&#24093;&#29579;&#26377;&#30693;&#65292;&#32943;&#23450;&#24471;&#27668;&#20010;&#21322;&#27515;&#12290;

&#27809;&#20102;&#38431;&#20237;&#65292;&#19968;&#20010;&#20154;&#19981;&#30693;&#36947;&#24590;&#20040;&#36305;&#65292;&#23601;&#24819;&#22312;&#36335;&#19978;&#25214;&#20010;&#30446;&#26631;&#36319;&#30528;&#65292;&#22823;&#32422;&#36305;&#20986;&#20004;&#20844;&#37324;&#65292;&#30475;&#21040;&#19968;&#20010;&#19977;&#20154;&#38431;&#20237;&#65306;&#19968;&#20010;&#19977;&#21313;&#22810;&#23681;&#30340;&#30007;&#23376;
&#24102;&#30528;&#20004;&#20010;&#24180;&#36731;&#20154;&#65292;&#19968;&#30007;&#19968;&#22899;&#65292;&#20063;&#23601;&#21313;&#20116;&#20845;&#23681;&#12290;&#19977;&#20154;&#36305;&#24471;&#19981;&#24555;&#65292;&#24456;&#21248;&#36895;&#65292;&#30475;&#26679;&#23376;&#24212;&#35813;&#26159;&#27604;&#36739;&#19987;&#19994;&#30340;&#20154;&#12290;&#24930;&#24930;&#36319;&#20102;&#19968;&#20250;&#65292;&#35273;&#24471;
&#20182;&#20204;&#30340;&#36895;&#24230;&#27604;&#36739;&#36866;&#21512;&#25105;&#65292;&#23601;&#20915;&#23450;&#19968;&#30452;&#36319;&#30528;&#12290; &#23601;&#36825;&#26679;&#65292;&#36319;&#22312;&#20182;&#20204;&#21518;&#38754;&#65292;&#36305;&#21040;&#20102;&#31532;&#19968;&#20010;&#21313;&#20844;&#37324;&#12290;&#22240;&#20026;&#24597;&#25481;&#38431;&#65292;&#26399;&#38388;&#19968;&#30452;&#27809;&#26377;
&#21917;&#27700;&#65292;&#30452;&#21040;&#20182;&#20204;&#21917;&#20102;&#25105;&#25165;&#21917;&#12290;&#21069;&#21313;&#20844;&#37324;&#20182;&#20204;&#19968;&#30452;&#20445;&#25345;10&#20844;&#37324;/&#23567;&#26102;&#30340;&#37197;&#36895;&#65292;&#21487;&#33021;&#35273;&#24471;&#26377;&#28857;&#24930;&#20102;&#65292;&#36807;&#20102;&#21313;&#20844;&#37324;&#21518;&#24320;&#22987;&#21152;&#36895;&#65292;
&#25105;&#35273;&#24471;&#20307;&#21147;&#23578;&#21487;&#65292;&#23601;&#36319;&#30528;&#19968;&#36215;&#21152;&#36895;&#12290;

&#21040;&#20102;&#19975;&#27849;&#27827;&#65292;&#24180;&#38271;&#30340;&#22823;&#21733;&#21435;&#27827;&#36793;&#8220;&#25918;&#27700;&#8221;&#65292;&#25105;&#20063;&#31245;&#24494;&#26377;&#28857;&#24863;&#35273;&#65292;&#23601;&#36319;&#30528;&#19968;&#36215;&#36807;&#21435;&#20102;&#65292;&#19981;&#36807;&#22823;&#21733;&#22065;&#21648;&#20457;&#24180;&#23567;&#30340;&#36824;&#26159;&#19968;&#30452;
&#20445;&#25345;&#36895;&#24230;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#25918;&#23436;&#27700;&#20986;&#26469;&#23601;&#25214;&#19981;&#21040;&#20182;&#20204;&#20102;&#65292;&#24448;&#21069;&#26395;&#21435;&#20840;&#26159;&#28165;&#19968;&#33394;&#30340;&#39532;&#25289;&#26494;&#34915;&#26381;&#65292;&#26681;&#26412;&#20998;&#36776;&#19981;&#20986;&#26469;&#12290;&#26080;&#22856;&#65292;&#21482;&#22909;
&#21448;&#19968;&#20010;&#20154;&#32487;&#32493;&#36305;&#12290;

&#19968;&#20010;&#20154;&#36305;&#65292;&#27880;&#24847;&#21147;&#23601;&#24320;&#22987;&#20998;&#25955;&#20102;&#65292;&#24320;&#22987;&#27880;&#24847;&#36523;&#36793;&#36807;&#21435;&#30340;&#21508;&#31181;&#20154;&#65306;&#19968;&#20010;&#22806;&#22269;&#32654;&#22899;&#65292;&#36523;&#39640;&#24471;&#19968;&#31859;&#20843;&#65292;&#36305;&#21322;&#31243;&#65292;&#27493;&#23376;&#36808;&#30340;&#36229;&#22823;&#65292;
&#27599;&#19968;&#27493;&#37117;&#24863;&#35273;&#22905;&#29992;&#23613;&#20102;&#21147;&#27668;&#65292;&#36335;&#36935;&#21478;&#19968;&#20010;&#32769;&#22806;&#65292;&#22840;&#22905;&#30495;&#21385;&#23475;&#65292;&#22905;&#22823;&#21564;&#8220;i am dying&#8221;;&#26377;&#20010;&#21733;&#20204;&#65292;&#20307;&#37325;&#27604;&#36739;&#32982;&#65292;&#31455;&#28982;
&#36824;&#36305;&#24471;&#25402;&#24555;&#12290;&#36824;&#26377;&#21478;&#19968;&#23545;&#22806;&#22269;&#22827;&#22919;&#65292;&#24471;&#20845;&#21313;&#24320;&#22806;&#20102;&#65292;&#19968;&#36215;&#36305;&#21322;&#31243;&#12290;&#36335;&#19978;&#36824;&#30896;&#21040;&#19968;&#20010;&#36196;&#33050;&#36305;&#27493;&#30340;&#38431;&#20237;&#65292;&#24456;&#21385;&#23475;&#65292;&#36196;&#33050;&#36305;
&#20844;&#36335;&#36824;&#26159;&#34542;&#30171;&#33510;&#30340;&#12290;

&#25105;&#21916;&#27426;&#36825;&#26679;&#30340;&#32463;&#21382;&#65292;&#23601;&#36319;&#26053;&#34892;&#19968;&#26679;&#65292;&#36825;&#31181;&#22312;&#36335;&#19978;&#30340;&#24863;&#35273;&#65292;&#25105;&#21487;&#20197;&#36935;&#21040;&#21508;&#31181;&#21508;&#26679;&#30340;&#20154;&#65292;&#26080;&#35770;&#24180;&#40836;&#65292;&#26080;&#35770;&#32932;&#33394;&#65292;&#25110;&#26159;&#21916;&#27426;&#28909;&#38393;&#65292;
&#25110;&#26159;&#20026;&#20102;&#23454;&#29616;&#30446;&#26631;&#65292;&#25110;&#26159;&#20026;&#20102;&#19968;&#20010;&#25215;&#35834;&#65292;&#25110;&#32773;&#65292;&#20165;&#20165;&#26159;&#23545;&#36305;&#27493;&#32431;&#31929;&#30340;&#28909;&#29233;&#12290;&#27599;&#20010;&#20154;&#37117;&#26377;&#33258;&#24049;&#30340;&#25925;&#20107;&#65292;&#28982;&#21518;&#25105;&#20204;&#19968;&#36215;&#26500;&#36896;&#20102;
&#20170;&#24180;&#30340;&#39532;&#25289;&#26494;&#25925;&#20107;&#12290;

&#26377;&#20102;&#21435;&#24180;&#21518;&#21322;&#27573;&#32570;&#27700;&#30340;&#25945;&#35757;&#65292;&#22312;&#21322;&#31243;&#24555;&#32467;&#26463;&#30340;&#26102;&#20505;&#12290;&#25105;&#23601;&#22312;&#20379;&#32473;&#22788;&#25343;&#20102;&#19968;&#29942;&#20339;&#24471;&#20048;&#65292;&#25343;&#22312;&#25163;&#37324;&#36305;&#65292;&#21518;&#26469;&#65292;&#23601;&#36807;&#20102;&#21322;&#31243;&#65292;&#22909;&#22810;
&#20154;&#22312;&#21322;&#31243;&#30340;&#26102;&#20505;&#21162;&#21147;&#20914;&#21050;&#12290;&#30475;&#20182;&#20204;&#23436;&#25104;&#20102;&#30446;&#26631;&#65292;&#24456;&#26367;&#20182;&#20204;&#39640;&#20852;&#12290;&#24819;&#24819;&#25105;&#33267;&#23569;&#36824;&#35201;&#36305;&#19977;&#20010;&#23567;&#26102;&#65292;&#33136;&#24320;&#22987;&#30140;&#36215;&#26469;&#12290;


(To be continue)

</pre>
  </body>
</html>
