<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.43 in css mode. -->
<html>
  <head>
    <title>What-do-I-learn-from-the-project.org</title>
    <style type="text/css">
    <!--
      body {
        color: #DCDCCC;
        background-color: #3F3F3F;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
---
layout: post
title: &#39033;&#30446;&#24635;&#32467;
category: Life
tag: [Tech]
description: [Thought about my recent project]
---

&#20170;&#24180;&#20570;&#36807;&#30340;&#19968;&#20010;&#39033;&#30446;&#30340;&#24635;&#32467;&#65292;&#35760;&#19979;&#26377;&#29992;&#30340;&#32463;&#39564;&#12290;

#### 1. &#20570;&#22909;&#21069;&#26399;&#35268;&#21010;

&#19968;&#23450;&#23545;&#20320;&#21363;&#23558;&#20570;&#30340;&#19996;&#35199;&#26377;&#19968;&#20010;&#25972;&#20307;&#30340;&#36718;&#24275;&#65292;&#39318;&#20808;&#35201;&#26126;&#30830;&#36825;&#20010;&#19996;&#35199;&#26159;&#20160;&#20040;&#65292;&#20855;&#26377;&#20160;&#20040;&#26679;&#30340;&#21151;&#33021;&#12290;&#28982;&#21518;&#65292;&#21010;&#20998;&#27169;&#22359;&#65292;&#27599;&#20010;&#27169;&#22359;&#35201;&#20570;&#20160;&#20040;&#20107;&#24773;&#65292;&#26368;&#22823;&#21270;&#23454;&#29616;&#27169;&#22359;&#20043;&#38388;&#30340;&#20302;&#32806;&#21512;&#24230;&#65292;&#27169;&#22359;&#20043;&#38388;&#23613;&#37327;&#29992;&#26368;&#23569;&#30340;API&#12290;&#23450;&#20041;&#27599;&#20010;&#27169;&#22359;&#30340;API&#65292;&#26368;&#22909;&#33021;&#32454;&#21270;&#21040;&#24212;&#35813;&#29992;&#20960;&#20010;&#32447;&#31243;&#25110;&#20989;&#25968;&#23454;&#29616;&#35813;&#27169;&#22359;&#12290;

&#25105;&#35273;&#24471;&#36825;&#20010;&#36807;&#31243;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65292;&#22914;&#26524;&#26159;&#19968;&#20010;team&#20849;&#21516;&#20570;&#36825;&#20010;&#19996;&#35199;&#65292;&#19968;&#23450;&#35201;&#32463;&#24120;&#24615;&#30340;&#24320;&#20250;&#35752;&#35770;&#65292;&#21453;&#22797;&#20462;&#25913;&#12290;&#22914;&#26524;&#26159;&#19968;&#20010;&#20154;&#20570;&#65292;&#20063;&#35201;&#25226;&#26550;&#26500;&#22270;&#23436;&#25972;&#30340;&#25551;&#36848;&#20986;&#26469;&#65292;&#24182;&#19981;&#26029;&#30340;review&#12290;&#34429;&#28982;&#24456;&#22810;&#20154;&#65288;&#21253;&#25324;&#25105;&#65289;&#37117;&#21916;&#27426;&#19978;&#26469;&#23601;&#30452;&#25509;&#20889;&#20195;&#30721;&#65292;&#20294;&#26159;&#36825;&#27425;&#39033;&#30446;&#32463;&#39564;&#35753;&#25105;&#20102;&#35299;&#21040;&#65292;&#21069;&#26399;&#26550;&#26500;&#25551;&#36848;&#30340;&#36234;&#23436;&#25972;&#65292;&#21518;&#26399;&#30340;&#25913;&#21160;&#23601;&#20250;&#36234;&#23567;&#12290;

#### 2. &#29992;Git&#32500;&#25252;&#20195;&#30721;&#24211;

&#24403;&#28982;&#20063;&#21487;&#20197;&#29992;&#21035;&#30340;&#29256;&#26412;&#24211;&#24037;&#20855;&#65292;&#20294;&#26159;&#20154;&#20154;&#37117;&#29233;git&#12290;

&#25105;&#26159;&#20010;&#30053;&#26377;&#8220;&#27905;&#30294;&#8221;&#30340;&#20154;&#65292;&#26377;&#26102;&#20505;&#30475;&#21040;&#19968;&#20123;&#26080;&#20851;&#30171;&#30162;&#30340;&#22320;&#26041;&#65292;&#20363;&#22914;&#20195;&#30721;&#21629;&#21517;&#12289;&#26684;&#24335;&#31561;&#19981;&#39034;&#30524;&#65292;&#37117;&#21916;&#27426;&#25913;&#19968;&#19979;&#12290;&#20294;&#25105;&#36824;&#26159;&#35748;&#20026;&#19981;&#35201;&#25226;&#27599;&#27425;&#36825;&#31181;&#32454;&#23567;&#30340;&#25913;&#21160;&#37117;&#24403;&#25104;&#19968;&#27425;&#20462;&#25913;&#25552;&#20132;&#21040;git&#20013;&#65292;&#36825;&#20250;&#20351;log&#35760;&#24405;&#21464;&#24471;&#20887;&#38271;&#19988;&#26080;&#29992;&#12290;&#23613;&#37327;&#20351;&#27599;&#19968;&#27425;&#25552;&#20132;&#37117;&#26159;&#26377;&#24847;&#20041;&#30340;&#25552;&#20132;&#65292;&#20687;&#26159;&#20462;&#25913;bug&#12289;&#20462;&#25913;&#21151;&#33021;&#25110;&#26159;&#22686;&#21152;&#26032;&#21151;&#33021;&#12290;

&#20889;&#22909;gitignore&#25991;&#20214;&#65292;&#21482;&#36861;&#36394;git&#24211;&#30340;&#28304;&#20195;&#30721;&#25991;&#20214;&#12290;&#24573;&#30053;&#25481;tags,cscope.out&#36825;&#20123;&#26377;&#29992;&#32463;&#24120;&#20986;&#29616;&#30340;&#25991;&#20214;&#12290;&#35774;&#23450;&#20320;&#21916;&#27426;&#30340;&#39068;&#33394;&#36755;&#20986;&#65292;&#23588;&#20854;&#26159;git diff&#12290;&#26377;git format-patch &#26368;&#22909;&#21152;&#19978;'-s'&#65292;&#36825;&#26679;&#20154;&#20154;&#37117;&#30693;&#36947;&#26159;&#20320;&#25552;&#20379;&#30340;patch&#20102;&#12290;

&#29992;&#22909;git tag&#12290;

#### 3. &#20889;&#22909;Test Case

&#21069;&#36744;&#32463;&#24120;&#25945;&#32946;&#25105;&#20204;&#65306;&#20320;&#30340;&#20195;&#30721;&#65292;&#21482;&#26377;&#20320;&#33258;&#24049;&#26368;&#25026;&#12290;&#20889;&#22909;test case&#30340;&#19968;&#20010;&#22909;&#22788;&#23601;&#26159;&#65306;&#19981;&#29992;&#27599;&#27425;&#20889;&#23436;&#19968;&#27573;&#20195;&#30721;&#37117;&#35201;&#20154;&#24037;&#27979;&#35797;&#12290;

&#21478;&#19968;&#20010;&#22909;&#22788;&#23601;&#26159;&#65306;&#21487;&#20197;&#39034;&#20415;&#23398;&#20064;&#19968;&#38376;&#26032;&#35821;&#35328;&#65292;&#20363;&#22914;python&#12290;

&#22522;&#26412;&#21151;&#33021;&#30340;test case&#26159;&#24517;&#39035;&#30340;&#65292;&#20320;&#30340;&#27169;&#22359;&#20855;&#22791;&#20160;&#20040;&#26679;&#30340;&#21151;&#33021;&#65292;&#20320;&#23601;&#35201;&#20889;case&#27979;&#35797;&#20182;&#26377;&#27809;&#26377;&#36825;&#20123;&#21151;&#33021;&#12290;

&#21478;&#19968;&#26041;&#38754;&#65292;&#20320;&#21487;&#20197;&#20687;&#32769;&#39037;&#31461;&#19968;&#26679;&#65292;&#29609;&#8220;&#24038;&#21491;&#20114;&#25615;&#8221;&#30340;&#28216;&#25103;&#65306;&#20889;&#19968;&#20123;&#21464;&#24577;&#30340;Test Case&#23545;&#27169;&#22359;&#36827;&#34892;&#8220;&#29378;&#36720;&#20081;&#28856;&#8221;&#65292;&#30475;&#30475;&#20320;&#30340;&#27169;&#22359;&#33021;&#21542;&#25269;&#25377;&#20303;&#34989;&#20987;&#12290;
&#28982;&#21518;&#65292;&#20320;&#23601;&#30693;&#36947;&#21738;&#26041;&#38754;&#38656;&#35201;&#25913;&#36827;&#20102;&#12290;

#### 4. &#20351;&#29992;&#21487;&#21464;&#21442;&#25968;&#23439;

&#39033;&#30446;&#21069;&#26399;&#65292;&#24320;&#22987;&#20889;&#20195;&#30721;&#20043;&#21518;&#65292;&#24635;&#38656;&#35201;&#22312;&#20195;&#30721;&#20013;&#28155;&#21152;&#19968;&#20123;&#35843;&#35797;&#25163;&#27573;&#12290;&#21518;&#26399;&#38656;&#35201;&#21457;&#24067;&#26102;&#65292;&#38656;&#35201;&#25226;&#36825;&#20123;&#35843;&#35797;&#25163;&#27573;&#20851;&#25481;&#65292;&#22914;&#26524;&#36890;&#36807;&#28155;/&#21024;&#20195;&#30721;&#30340;&#26041;&#24335;&#26469;&#20570;&#65292;
&#37027;&#19968;&#26465;&#26465;&#21024;&#38500;&#30340;&#24037;&#20316;&#37327;&#20250;&#24456;&#22823;&#65292;&#32780;&#19988;&#26410;&#24517;&#33021;&#21024;&#30340;&#24178;&#20928;&#12290;

&#19968;&#20010;&#24120;&#29992;&#30340;&#26041;&#27861;&#26159;&#20351;&#29992;&#23439;&#24320;&#20851;&#21644;&#23439;&#26041;&#27861;&#12290;

&#23439;&#24320;&#20851;&#22522;&#26412;&#23601;&#26159;if else&#35821;&#27861;&#65292;&#22914;&#26524;&#23450;&#20041;&#20102;&#36825;&#20010;&#23439;&#65292;&#37027;&#20040;&#23601;&#25191;&#34892;A&#27573;&#20195;&#30721;&#65292;&#21542;&#21017;&#25191;&#34892;B&#27573;&#20195;&#30721;&#12290;&#21487;&#20197;&#36890;&#36807;&#22312;gcc&#20013;&#20351;&#29992;&#8220;-D&#8221;&#23450;&#20041;&#23439;&#65292;&#20363;&#22914;

      gcc -o helloworld -DHELLO helloword.c
  
      &#20195;&#30721;&#23454;&#29616;&#65306;
      #ifdefine TEST
        printf("hello world");
      #else
        printf("NO hello world");
      #endif

&#23439;&#26041;&#27861;&#20027;&#35201;&#26159;&#25351;&#20351;&#29992;&#23439;&#23553;&#35013;&#20989;&#25968;&#25110;&#20195;&#30721;&#65292;&#24120;&#35265;&#30340;&#19968;&#20010;&#22330;&#26223;&#26159;log&#36755;&#20986;&#65292;&#22312;&#23454;&#38469;&#39033;&#30446;&#20013;&#65292;&#32463;&#24120;&#20250;&#23450;&#20041;&#19968;&#32452;&#36890;&#29992;&#30340;&#23439;API&#20195;&#26367;printf()&#31995;&#21015;&#20989;&#25968;&#12290;
&#20363;&#22914;&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#20989;&#25968;__lxlog(type, msg)&#65292;&#32780;&#19988;&#35201;msg&#25903;&#25345;format&#26684;&#24335;&#65292;&#21363;__lxlog(type, format, str...),
&#37027;&#25105;&#20204;&#21487;&#20197;&#29992;&#23439;&#26469;&#23553;&#35013;&#36825;&#20010;&#20989;&#25968;&#65306;

      #define LXLOG(type,format,str...) __lxlog(type, format, str...)

&#22312;&#23439;&#20013;&#21487;&#20197;&#23545;&#21442;&#25968;&#36827;&#34892;&#31616;&#21270;&#65292;&#29992;&#30465;&#30053;&#21495;&#20195;&#26367;&#65292;&#20363;&#22914;&#19978;&#38754;&#35821;&#21477;&#21487;&#20197;&#20889;&#25104;

      #define LXLOG(type, format, ...)      __lxlog(type, format, __VA_ARGS__)
      &#25110;&#32773;
      #define LXLOG(type, format, ...)      __lxlog(type, format, ##__VAR_ARGS__)
      
&#31532;&#20108;&#31181;&#34920;&#31034;&#26041;&#24335;&#30340;&#22909;&#22788;&#26159;&#65292;&#24403;&#21487;&#21464;&#21442;&#25968;&#20026;&#31354;&#65292;&#23427;&#20250;&#33258;&#21160;&#23558;__VAR_ARGS__&#21069;&#38754;&#30340;&#36887;&#21495;&#21435;&#25481;&#12290;&#20363;&#22914;&#65292;
&#22914;&#26524;&#20351;&#29992;&#31532;&#19968;&#31181;&#26041;&#27861;&#35843;&#29992;LXLOG(ERROR, "err"),&#21017;&#20250;&#32534;&#35793;&#22833;&#36133;&#65292;&#22240;&#20026;&#23637;&#24320;&#21518;&#20989;&#25968;__lx_log()&#37324;&#22810;&#20102;&#19968;&#20010;&#36887;&#21495;&#12290;
&#32780;&#20351;&#29992;&#31532;&#20108;&#31181;&#26041;&#24335;&#20250;&#33258;&#21160;&#23558;&#36887;&#21495;&#21435;&#25481;&#12290;

&#22914;&#26524;&#35273;&#24471;&#27599;&#27425;&#37117;&#35201;&#36755;&#20837;type&#40635;&#28902;&#65292;&#20063;&#21487;&#20197;&#32487;&#32493;&#23545;LXLOG&#36827;&#34892;&#23553;&#35013;&#12290;

      #define LXERROR(...)    LXLOG(ERROR, ##__VA_ARGS__)
      #define LXDEBUG(...)    LXLOG(ERROR, ##__VA_ARGS__)
      ...
      
&#21892;&#29992;&#23439;&#24320;&#20851;&#21644;&#23439;&#21442;&#25968;&#65292;&#20250;&#20351;&#20195;&#30721;&#32500;&#25252;&#21464;&#24471;&#31616;&#21333;&#21487;&#38752;&#12290;

#### 5. &#22810;&#32447;&#31243;&#32534;&#31243;&#30340;&#27880;&#24847;&#20107;&#39033;

(1). &#21019;&#24314;&#32447;&#31243;&#26102;&#65292;&#20256;&#32473;&#32447;&#31243;&#30340;&#21442;&#25968;&#23613;&#37327;&#20351;&#29992;&#20840;&#23616;&#21464;&#37327;&#25110;&#38745;&#24577;&#21464;&#37327;&#12290;&#22914;&#26524;&#20351;&#29992;&#23616;&#37096;&#21464;&#37327;&#20316;&#20026;&#20256;&#32473;&#32447;&#31243;&#30340;&#21442;&#25968;&#65288;&#23613;&#37327;&#19981;&#35201;&#36825;&#20040;&#20570;&#65281;&#65289;&#65292;&#37027;&#20040;&#21019;&#24314;&#32447;&#31243;&#30340;&#20989;&#25968;&#35843;&#29992;&#23436;pthread_create()&#21518;&#22914;&#26524;&#31435;&#21363;&#36820;&#22238;&#65292;&#20250;&#23548;&#33268;&#38745;&#24577;&#21464;&#37327;&#34987;&#37322;&#25918;&#65292;&#20854;&#25351;&#21521;&#30340;&#20869;&#23481;&#22312;&#32447;&#31243;&#20013;&#23601;&#21464;&#24471;&#26410;&#30693;&#65292;&#21487;&#33021;&#23548;&#33268;&#38750;&#27861;&#35775;&#38382;&#12290;&#24403;&#28982;&#21487;&#20197;&#35753;&#20989;&#25968;&#35843;&#29992;&#23436;pthread_create() sleep&#19968;&#27573;&#26102;&#38388;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#20294;&#26159;&#36825;&#24182;&#19981;&#26159;&#33391;&#22909;&#30340;&#32534;&#31243;&#39118;&#26684;&#65288;&#20010;&#20154;&#35266;&#28857;&#65289;&#12290;&#22240;&#20026;&#27704;&#36828;kernel&#30340;&#35843;&#24230;&#34892;&#20026;&#26159;&#26080;&#27861;&#39044;&#30693;&#30340;&#65292;&#36890;&#24120;&#24773;&#20917;sleep&#20960;&#31186;&#21487;&#33021;&#20250;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#20294;&#22914;&#26524;&#31995;&#32479;loading&#22826;&#37325;&#65292;&#20960;&#31186;&#30340;&#26102;&#38388;&#26410;&#24517;&#20250;&#22815;&#29992;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;sleep&#26102;&#38388;&#22826;&#38271;&#65292;&#21017;&#21487;&#33021;&#20250;&#24433;&#21709;&#29238;&#32447;&#31243;&#30340;&#34892;&#20026;&#12290;

(2). &#22312;&#25152;&#26377;&#38656;&#35201;&#21152;&#38145;&#30340;&#22320;&#26041;&#21152;&#38145;&#12290;&#36825;&#26159;&#20010;&#32769;&#29983;&#24120;&#35848;&#30340;&#38382;&#39064;&#65292;&#22823;&#19968;&#30340;&#26102;&#20505;&#32769;&#24072;&#37117;&#24050;&#32463;&#21578;&#35819;&#36807;&#22823;&#23478;&#12290;&#19981;&#35201;&#22826;&#36807;&#30456;&#20449;&#33258;&#24049;&#30340;&#35774;&#35745;&#65288;&#32780;&#19981;&#21152;&#38145;&#65289;&#65292;&#21482;&#35201;&#20320;&#30340;&#20195;&#30721;&#21487;&#33021;&#34987;&#22810;&#20010;&#32447;&#31243;&#35775;&#38382;&#65292;&#23601;&#26377;&#21487;&#33021;&#20986;&#29616;&#31454;&#20105;&#12290;&#19968;&#23450;&#35201;&#22312;&#27169;&#22359;&#35774;&#35745;&#21021;&#26399;&#23601;&#35774;&#35745;&#22909;&#38145;&#65292;&#19981;&#28982;&#21518;&#26399;&#30340;&#32500;&#25252;&#20250;&#24456;&#40635;&#28902;&#12290;

(3). pthread_kill()&#30340;&#20351;&#29992;&#65292;&#22914;&#26524;&#22312;&#20195;&#30721;&#20013;&#29992;&#21040;&#36825;&#20010;&#20989;&#25968;&#12290;&#23545;&#20110;&#21487;&#33021;&#29992;&#21040;&#30340;&#27599;&#20010;signal(&#38500;&#38750;&#20320;&#21482;&#26159;&#29992;&#26469;&#26816;&#26597;&#32447;&#31243;&#26159;&#21542;&#23384;&#22312;)&#65292;&#19968;&#23450;&#35201;&#22312;&#32447;&#31243;&#37324;&#35774;&#35745;&#22909;&#30456;&#20851;&#30340;signal handler&#65292;&#19981;&#28982;&#35813;&#20989;&#25968;&#21457;&#36865;&#30340;signal&#20250;&#34987;&#25972;&#20010;&#36827;&#31243;&#25509;&#21463;&#24182;&#22788;&#29702;&#12290;
</pre>
  </body>
</html>
