<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.43 in css mode. -->
<html>
  <head>
    <title>wutaishan.org</title>
    <style type="text/css">
    <!--
      body {
        color: #DCDCCC;
        background-color: #3F3F3F;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-weight: bold;
      }
      .org-meta-line {
        /* org-meta-line */
        color: #7F9F7F;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
  </head>
  <body>
    <pre>
<span class="org-meta-line">#+OPTIONS: ^:nil</span>
<span class="org-meta-line">#+OPTIONS: toc:t H:2</span>
<span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">Zhengchao Xu
</span><span class="org-document-info-keyword">#+EMAIL:</span> <span class="org-document-info">xuzhengchaojob@gmail.com
</span><span class="org-document-info-keyword">#+TITLE:</span> <span class="org-document-title">&#20116;&#21488;&#23665;
</span>
&#25105;&#24120;&#24819;&#65292;&#22914;&#26524;&#37027;&#19968;&#22825;&#65292;&#25105;&#26377;&#20102;&#24456;&#22810;&#30340;&#33258;&#30001;&#26102;&#38388;&#65292;&#27604;&#22914;&#20004;&#20010;&#26376;&#20197;&#19978;&#65292;&#25105;&#24212;&#35813;&#20250;&#26469;&#20116;&#21488;&#23665;&#19968;&#36255;&#65292;
&#24403;&#19968;&#20010;&#8220;&#23621;&#22763;&#8221;&#65292;&#20116;&#20010;&#21488;&#30340;&#23546;&#24217;&#65292;&#37117;&#20303;&#19978;&#19968;&#21040;&#20004;&#22825;&#12290;

&#26089;&#26216;&#65292;&#22825;&#26410;&#20142;&#23601;&#36215;&#24202;&#65292;&#21040;&#38498;&#23376;&#37324;&#21548;&#24072;&#20613;&#20204;&#20570;&#21151;&#35838;&#65292;&#24110;&#24537;&#20570;&#26089;&#25995;&#12290;&#21507;&#23436;&#39277;&#21518;&#65292;&#22312;&#23546;&#38498;&#38468;&#36817;&#25955;&#27493;&#65292;
&#36319;&#20462;&#34892;&#30340;&#24072;&#20613;&#20204;&#32842;&#32842;&#22825;&#65292;&#24863;&#24735;&#19968;&#19979;&#20462;&#34892;&#32773;&#30340;&#24605;&#24819;&#12290;&#25110;&#32773;&#24110;&#24072;&#20613;&#20204;&#31181;&#31181;&#33756;&#65292;&#37319;&#37319;&#33457;&#12290;
&#20013;&#21320;&#29992;&#36807;&#21320;&#39277;&#21518;&#65292;&#23601;&#21578;&#21035;&#36825;&#20010;&#21488;&#65292;&#36215;&#36523;&#21069;&#24448;&#19979;&#19968;&#20010;&#65292;&#24930;&#24930;&#30340;&#36208;&#65292;&#32454;&#32454;&#30340;&#30475;&#65292;&#24863;&#21463;&#34013;&#22825;&#12289;&#30333;&#20113;&#12289;
&#33609;&#22320;&#12289;&#39567;&#39532;&#65292;&#20197;&#21450;&#39640;&#23665;&#29378;&#37326;&#30340;&#39118;&#12290;&#20621;&#26202;&#30340;&#26102;&#20505;&#21040;&#36798;&#19979;&#19968;&#20010;&#21488;&#30340;&#23546;&#24217;&#65292;&#29992;&#36807;&#25995;&#39277;&#65292;&#22825;&#23601;&#40657;&#20102;&#65292;
&#27809;&#26377;&#38451;&#20809;&#30340;&#20116;&#21488;&#23665;&#29305;&#21035;&#20919;&#65292;&#21482;&#33021;&#30041;&#22312;&#23458;&#25151;&#37324;&#65292;&#22823;&#36890;&#38138;&#65292;&#24456;&#22810;&#26053;&#34892;&#32773;&#37117;&#24320;&#22987;&#30561;&#35273;&#65292;
&#21628;&#22108;&#22768;&#27492;&#36215;&#24444;&#20239;&#65292;&#25171;&#25195;&#21355;&#29983;&#30340;&#32769;&#24072;&#20613;&#26368;&#21518;&#19968;&#20010;&#36827;&#26469;&#65292;&#21507;&#19968;&#20010;&#29983;&#33821;&#21340;&#65292;&#20851;&#28783;&#65292;&#19978;&#24202;&#65292;
&#28982;&#21518;&#19981;&#20572;&#30340;&#24565;&#8220;&#38463;&#24357;&#38464;&#20315;...&#8221;&#12290;

&#25105;&#19981;&#30693;&#36947;&#33258;&#24049;&#20026;&#20160;&#20040;&#20250;&#26377;&#36825;&#26679;&#30340;&#24819;&#27861;&#65292;&#21487;&#33021;&#22312;&#36807;&#21435;&#26576;&#19968;&#22825;&#30340;&#26576;&#19968;&#26102;&#21051;&#65292;&#25105;&#30475;&#21040;&#20160;&#20040;&#19996;&#35199;&#65292;
&#28982;&#21518;&#36825;&#20010;&#24819;&#27861;&#31361;&#28982;&#23601;&#20882;&#20102;&#20986;&#26469;&#65292;&#19968;&#30452;&#23384;&#22312;&#30528;&#12290;&#23601;&#20687;&#25105;&#29616;&#22312;&#27599;&#24180;&#37117;&#20250;&#26469;&#20116;&#21488;&#23665;&#19968;&#26679;&#65292;
&#19981;&#30693;&#36947;&#20026;&#20160;&#20040;&#35201;&#36825;&#20040;&#20570;&#65292;&#21482;&#26159;&#21333;&#32431;&#35273;&#24471;&#24212;&#35813;&#36825;&#20040;&#20570;&#12290;

&#20116;&#21488;&#23665;&#26159;&#25105;&#25104;&#38271;&#30340;&#22320;&#26041;&#65292;&#31532;&#19968;&#27425;&#26397;&#21488;&#26159;&#25105;&#20307;&#21147;&#21644;&#24847;&#24535;&#21147;&#30340;&#19968;&#27425;&#39134;&#36291;&#12290;&#22914;&#26524;&#26377;&#20154;&#38382;&#25105;&#19968;&#20123;&#20851;&#20110;&#26053;&#34892;&#12289;
&#20851;&#20110;&#25143;&#22806;&#30340;&#25925;&#20107;&#12290;&#25105;&#21487;&#33021;&#20250;&#32473;&#20182;&#35762;&#35762;&#25105;&#31532;&#19968;&#27425;&#26397;&#21488;&#30340;&#25925;&#20107;&#65292;&#19968;&#20010;&#25402;&#26222;&#36890;&#30340;&#25925;&#20107;&#65292;&#27809;&#26377;&#24778;&#38505;&#21050;&#28608;&#65292;
&#20294;&#23545;&#25105;&#21364;&#26377;&#24456;&#22823;&#30340;&#24847;&#20041;&#65292;&#23427;&#26159;&#25105;&#21518;&#26469;&#24456;&#22810;&#20107;&#24773;&#30340;&#31934;&#31070;&#36215;&#28857;&#12290;

&#20986;&#21457;&#21069;&#19968;&#26202;&#65292;&#20843;&#20010;&#20154;&#22312;&#35199;&#31449;&#38598;&#21512;&#23436;&#27605;&#65292;&#22240;&#20026;&#27809;&#20080;&#21040;&#21351;&#38138;&#65292;&#19968;&#19978;&#36710;&#22823;&#23478;&#23601;&#36305;&#21040;&#36710;&#21410;&#20013;&#37096;&#65292;&#22352;&#22312;&#22320;&#19978;&#65292;
&#32842;&#22825;&#65292;&#29609;&#26432;&#20154;&#28216;&#25103;&#12290;&#21040;&#20102;&#21322;&#22812;1&#28857;&#22810;&#65292;&#23454;&#22312;&#25745;&#19981;&#20303;&#20102;&#65292;&#23601;&#24320;&#22987;&#22352;&#30528;&#30561;&#35273;&#65292;&#21518;&#26469;&#30475;&#29503;&#20154;&#20182;&#20204;&#38075;&#21040;&#24231;&#20301;&#24213;&#19979;&#30561;&#35273;&#65292;
&#26263;&#33258;&#36190;&#21497;&#36825;&#25165;&#26159;&#25143;&#22806;&#31934;&#31070;&#65292;&#20110;&#26159;&#20063;&#36319;&#30528;&#23398;&#20102;&#36215;&#26469;&#65292;&#25214;&#20102;&#20010;&#24231;&#20301;&#38075;&#20102;&#19979;&#21435;&#65292;&#31359;&#30528;&#26032;&#20080;&#30340;&#12289;
&#26410;&#31359;&#36807;&#30340;&#20914;&#38155;&#34915;&#12290;&#19968;&#36827;&#21435;&#19968;&#32929;&#27987;&#27987;&#30340;&#33050;&#33261;&#21619;&#23601;&#25169;&#38754;&#32780;&#26469;&#65292;&#24378;&#24525;&#30528;&#65292;&#21518;&#26469;&#24930;&#24930;&#23601;&#30561;&#20102;&#19968;&#20250;&#12290;&#19981;&#20165;&#24515;&#24819;&#65292;
&#24819;&#25308;&#35265;&#20315;&#31062;&#26524;&#28982;&#19981;&#26159;&#37027;&#20040;&#23481;&#26131;&#30340;&#12290;

&#26089;&#26216;&#22235;&#28857;&#21322;&#65292;&#28779;&#36710;&#21040;&#31449;&#65292;&#22825;&#26410;&#20142;&#65292;&#28459;&#22825;&#26143;&#36784;&#65292;&#24456;&#20919;&#12290;&#20986;&#31449;&#22352;&#19978;&#21435;&#40511;&#38376;&#23721;&#30340;&#23567;&#24052;&#36710;&#12290;&#31532;&#19968;&#27425;&#36367;&#19978;&#23665;&#35199;&#30340;&#22303;&#22320;&#65292;
&#26377;&#28857;&#22909;&#22855;&#65292;&#22312;&#36335;&#19978;&#23601;&#19968;&#30452;&#21521;&#22806;&#30475;&#65292;&#30475;&#23665;&#35199;&#26159;&#21542;&#36319;&#20256;&#35828;&#20013;&#30340;&#19968;&#26679;&#21040;&#22788;&#29028;&#28784;&#12290;&#30475;&#30528;&#30475;&#30528;&#23601;&#30561;&#30528;&#20102;&#12290;
&#26179;&#30528;&#26179;&#30528;&#23601;&#21040;&#20102;&#26397;&#21488;&#30340;&#36215;&#28857;&#65306;&#40511;&#38376;&#23721;&#12290;&#19979;&#36710;&#65292;&#25972;&#29702;&#35013;&#22791;&#65292;&#20986;&#21457;&#21435;&#19996;&#21488;&#12290;

&#27492;&#26102;&#22826;&#38451;&#21018;&#20174;&#19996;&#26041;&#21319;&#36215;&#19981;&#20037;&#65292;&#26085;&#20809;&#29031;&#22312;&#19996;&#21488;&#30340;&#23665;&#22369;&#19978;&#65292;&#19968;&#29255;&#37329;&#40644;&#65292;&#26080;&#27604;&#31070;&#22307;&#12290;&#19978;&#23665;&#36335;&#19978;&#65292;
&#20250;&#30475;&#21040;&#22823;&#22823;&#23567;&#23567; &#30340;&#29595;&#23612;&#22534;&#65292;&#25105;&#26159;&#31532;&#19968;&#27425;&#35265;&#36825;&#19996;&#35199;&#65292;&#30693;&#36947;&#23427;&#26159;&#34255;&#26063;&#20154;&#27665;&#30340;&#19968;&#31181;&#20449;&#20208;&#12290;&#20110;&#26159;&#20063;&#25214;&#20102;&#19968;&#22359;&#30707;&#22836;&#65292;
&#25918;&#21040;&#20102;&#20854;&#20013;&#30340;&#19968;&#20010;&#29595;&#23612;&#22534;&#19978;&#65292;&#31048;&#31095;&#36825;&#27425;&#26397;&#21488;&#39034;&#21033;&#12290;

&#21040;&#20102;&#19996;&#21488;&#39030;&#65292;&#22825;&#24050;&#22823;&#20142;&#65292;&#20294;&#38451;&#20809;&#36824;&#26410;&#28201;&#26262;&#65292;&#23506;&#39118;&#20955;&#20925;&#12290;&#21040;&#21488;&#39030;&#30340;&#24217;&#37324;&#65292;&#25918;&#19979;&#21253;&#65292;&#21435;&#30475;&#25991;&#27530;&#33769;&#33832;&#30340;&#19968;&#20010;&#20315;&#20687;&#65292;
&#24456;&#22810;&#34388;&#35802;&#30340;&#22919;&#22899;&#22312;&#25308;&#12290;&#35834;&#22823;&#30340;&#19968;&#29255;&#20116;&#21488;&#23665;&#65292;&#37117;&#26159;&#25991;&#27530;&#33769;&#33832;&#30340;&#36947;&#22330;&#65292;&#27599;&#20010;&#21488;&#37117;&#26377;&#20182;&#30340;&#19968;&#20010;&#20998;&#36523;&#65292;
&#25484;&#31649;&#19981;&#21516;&#30340;&#20107;&#21153;&#12290;&#26397;&#21488;&#30340;&#36825;&#20004;&#22825;&#65292;&#26080;&#35770;&#22312;&#21738;&#37324;&#65292;&#25105;&#37117;&#35273;&#24471;&#20250;&#26377;&#19968;&#32929;&#20315;&#30340;&#31934;&#31070;&#21147;&#22330;&#22312;&#21253;&#22260;&#30528;&#36825;&#29255;&#22823;&#22320;&#65292;
&#22312;&#30475;&#30528;&#20320;&#65292;&#22312;&#24863;&#26579;&#30528;&#20320;&#12290;

&#19996;&#21488;&#19979;&#26469;&#65292;&#21448;&#22238;&#21040;&#20102;&#19979;&#36710;&#30340;&#40511;&#38376;&#23721;&#65292;&#24320;&#22987;&#36208;&#19978;&#21271;&#21488;&#30340;&#28459;&#28459;&#38271;&#36335;&#65292;&#36825;&#26102;&#20505;&#22826;&#38451;&#24050;&#32463;&#23436;&#20840;&#21319;&#36215;&#65292;&#38451;&#20809;&#26262;&#26262;&#30340;&#65292;
&#26194;&#21040;&#36523;&#19978;&#12290;&#26152;&#26202;&#30561;&#20004;&#20010;&#23567;&#26102;&#35273;&#30340;&#21103;&#20316;&#29992;&#31435;&#21051;&#34987;&#21796;&#37266;&#12290;&#22312;&#20844;&#36335;&#19978;&#36208;&#30528;&#36208;&#30528;&#65292;&#31455;&#28982;&#24320;&#22987;&#25171;&#30457;&#65292;&#20570;&#19968;&#20123;&#26029;&#26029;&#32493;&#32493;&#30340;&#26790;&#12290;
&#36208;&#36335;&#30561;&#35273;&#65292;&#25105;&#29983;&#24179;&#31532;&#19968;&#27425;&#26377;&#36825;&#31181;&#22855;&#22937;&#30340;&#32463;&#21382;&#12290;&#21518;&#26469;&#29503;&#20154;&#30475;&#22823;&#23478;&#23454;&#22312;&#22256;&#30340;&#19981;&#34892;&#65292;&#23601;&#22312;&#20013;&#38388;&#23567;&#24217;&#22788;&#36335;&#36793;&#20241;&#24687;&#65292;
&#23567;&#28789;&#36890;&#22312;&#22823;&#39532;&#36335;&#19978;&#25171;&#36215;&#20102;&#21628;&#22108;&#12290;&#30561;&#20102;&#21313;&#20960;&#20998;&#38047;&#65292;&#32487;&#32493;&#36214;&#36335;&#65292;&#25105;&#30340;&#33050;&#65292;&#23601;&#22312;&#37027;&#26102;&#20505;&#24320;&#22987;&#30140;&#20102;&#20197;&#26469;&#12290;

&#36825;&#27425;&#26397;&#21488;&#65292;&#26159;&#25105;&#31532;&#19968;&#27425;&#35748;&#35782;&#38795;&#23376;&#30340;&#37325;&#35201;&#24615;&#65292;&#23545;&#19968;&#20010;&#34892;&#32773;&#32780;&#35328;&#65292;&#19968;&#21452;&#33298;&#26381;&#30340;&#38795;&#23376;&#23601;&#26159;&#26368;&#22909;&#30340;&#35013;&#22791;&#65292;
&#36825;&#20010;&#35266;&#24565;&#23588;&#20854;&#22312;&#19979;&#21320;&#33050;&#30140;&#30340;&#27809;&#27861;&#36208;&#36335;&#26102;&#26356;&#20026;&#24378;&#28872;&#12290;&#20174;&#23567;&#24217;&#24320;&#22987;&#65292;&#36335;&#24320;&#22987;&#19978;&#22369;&#65292;&#39118;&#36234;&#26469;&#36234;&#22823;&#65292;&#19977;&#21315;&#31859;&#30340;&#28023;&#25300;&#65292;
&#24320;&#22987;&#26377;&#28857;&#23567;&#39640;&#21453;&#65292;&#22836;&#30140;&#12290;&#21152;&#19978;&#20197;&#21069;&#27809;&#36208;&#36807;&#36825;&#31181;&#24378;&#24230;&#30340;&#38431;&#20237;&#65292;&#20307;&#21147;&#24320;&#22987;&#36319;&#19981;&#19978;&#65292;&#24930;&#24930;&#25289;&#21040;&#20102;&#38431;&#20237;&#26411;&#31471;&#12290;
&#31934;&#31070;&#20063;&#24320;&#22987;&#26377;&#28857;&#28067;&#25955;&#12290;&#19981;&#36807;&#36824;&#26159;&#22362;&#25345;&#20102;&#19979;&#26469;&#65292;&#24182;&#19988;&#21040;&#20102;&#8220;&#21326;&#21271;&#23627;&#33034;&#8221;&#12290;

&#31532;&#19968;&#27425;&#21040;&#8220;&#21326;&#21271;&#23627;&#33034;&#8221;&#65292;&#24456;&#28608;&#21160;&#65292;&#27605;&#31455;&#36825;&#26159;&#21326;&#21271;&#26368;&#39640;&#28857;&#65292;&#34429;&#28982;&#28023;&#25300;&#21482;&#26377;&#19977;&#21315;&#22810;&#19968;&#28857;&#65292;&#20294;&#27492;&#21435;&#21521;&#19996;&#65292;&#30452;&#21040;&#28023;&#36793;&#65292;
&#24050;&#32463;&#27809;&#26377;&#27604;&#36825;&#36824;&#39640;&#30340;&#22320;&#26041;&#20102;&#12290;&#34429;&#28982;&#39118;&#36229;&#22823;&#65292;&#34429;&#28982;&#39118;&#24456;&#22823;&#65292;&#22823;&#23478;&#20249;&#36824;&#26159;&#26524;&#26029;&#33073;&#20102;&#19978;&#34915;&#65292;
&#25293;&#19968;&#24352;&#38712;&#27668;&#30340;&#32908;&#32905;&#29031;&#12290;

&#32456;&#20110;&#65292;&#22312;&#20013;&#21320;&#26102;&#21051;&#21040;&#36798;&#20102;&#21271;&#21488;&#39030;&#65292;&#25105;&#24863;&#35273;&#33258;&#24049;&#24050;&#32463;&#32047;&#24471;&#23436;&#20840;&#27809;&#20102;&#21147;&#27668;&#65292;&#22836;&#30171;&#27442;&#35010;&#65292;&#23665;&#39030;&#39118;&#36229;&#22823;&#65292;
&#20063;&#27809;&#26377;&#20160;&#20040;&#25377;&#39118;&#30340;&#22320;&#26041;&#65292;&#25152;&#20197;&#25105;&#20204;&#31245;&#24494;&#20241;&#24687;&#20102;&#19968;&#20250;&#65292;&#20915;&#23450;&#32487;&#32493;&#21521;&#21069;&#36208;&#65292;&#25214;&#19968;&#20010;&#31163;&#23546;&#24217;&#27604;&#36739;&#36828;&#30340;&#22320;&#26041;&#65292;
&#21507;&#26377;&#32905;&#30340;&#21320;&#39277;&#12290;&#21518;&#26469;&#22312;&#21271;&#21488;&#19979;&#38754;&#30340;&#22823;&#33609;&#30008;&#19978;&#65292;&#25214;&#20102;&#20004;&#22359;&#25377;&#39118;&#30340;&#22823;&#30707;&#22836;&#65292;&#29983;&#28779;&#20570;&#39277;&#65292;&#21507;&#23436;&#12290;&#22823;&#23478;&#21508;&#33258;&#25214;&#22320;&#30561;&#35273;&#19968;&#23567;&#26102;&#65292;
&#24443;&#24213;&#24674;&#22797;&#19968;&#19979;&#12290;&#35760;&#24471;&#22823;&#23478;&#24403;&#26102;&#37117;&#22312;&#32972;&#39118;&#22369;&#19978;&#30561;&#35273;&#65292;&#21482;&#26377;&#25105;&#19968;&#20010;&#26524;&#26029;&#36208;&#21040;&#20102;&#21521;&#39118;&#22369;&#19978;&#65292;&#22240;&#20026;&#26377;&#38451;&#20809;&#12290;
&#25105;&#24050;&#32463;&#27809;&#20102;&#31934;&#27668;&#31070;&#65292;&#38656;&#35201;&#25918;&#21040;&#38451;&#20809;&#19979;&#26194;&#26194;&#65292;&#34917;&#34917;&#38451;&#27668;&#12290;

&#20116;&#21488;&#23665;&#25105;&#21435;&#20102;&#19977;&#24180;&#65292;&#36825;&#19968;&#27425;&#21320;&#20241;&#65292;&#19968;&#30452;&#26159;&#30561;&#24471;&#26368;&#29245;&#30340;&#12290;&#25105;&#29992;&#20914;&#38155;&#34915;&#25226;&#22836;&#20840;&#37096;&#25410;&#19978;&#65292;&#33073;&#25481;&#38795;&#65292;&#39118;&#34429;&#28982;&#22823;&#19988;&#20919;&#65292;
&#20294;&#38451;&#20809;&#25269;&#25377;&#20102;&#24456;&#22810;&#30340;&#23506;&#27668;&#12290;&#39118;&#22768;&#22312;&#32819;&#36793;&#24594;&#21564;&#65292;&#20294;&#25105;&#24456;&#24555;&#23601;&#22312;&#38451;&#20809;&#19979;&#20837;&#30561;&#65292;&#24182;&#20570;&#20102;&#19968;&#20010;&#26790;&#12290;&#34429;&#28982;&#25105;&#24536;&#35760;&#20102;&#26790;&#30340;&#20869;&#23481;&#65292;
&#20294;&#21487;&#20197;&#32943;&#23450;&#37027;&#26159;&#19968;&#20010;&#27491;&#33021;&#37327;&#30340;&#26790;&#65292;&#22240;&#20026;&#37266;&#21518;&#25105;&#24863;&#35273;&#26159;&#24841;&#24742;&#30340;&#65292;&#27985;&#36523;&#21448;&#20805;&#28385;&#20102;&#21147;&#27668;&#12290;

</pre>
  </body>
</html>
